text = "Колишня розпродажна виручка виявилася мрією. Все було продано, навіть ті товари, що лежали на полицях занадто довго. Щасливий вигляд покупців свідчив про успіх події. Але задоволення від такого результату затмарила пізніша звістка про пожежу в складському приміщенні."

# 1. Розділення тексту на окремі слова
words = text.split()

# 2. Підрахунок кількості слів у тексті
word_count = len(words)

# 3. Заміна одного слова на інше
text_replaced = text.replace('результату', 'події')

print("Слова у тексті:", words)
print("Кількість слів у тексті:", word_count)
print("Текст після заміни:", text_replaced)

#Три функції, які потрібно застосувати до цього тексту наступному студенту:
#   upper(): Перетворення тексту у верхній регістр.
#   count(): Підрахунок кількості входжень певного слова у тексті.
#   startswith(): Перевірка, чи починається рядок з певної послідовності символів.