# Костян О. 1-ий студент
try:
    # Відкриття файлу для запису
    with open('questions1.txt', 'w', encoding='utf-8') as file:
        # Запис прізвища та питання першого студента
        file.write("Прізвище першого студента: Костян\n")
        file.write("Питання від першого студента: Як створити список у Python?\n")
    print("Файл успішно створено та заповнено.")
except FileNotFoundError:
    print("Помилка: файл не знайдено.")
except Exception as e:
    print("Сталася помилка:", e)

# Коноплянченко Д. 2-ий студент
try:
    # відкриття файлу в режимі дозапису
    with open('questions1.txt', 'a', encoding='utf-8') as file:
        file.write('\n')
        file.write('Прізвище другого студента: Коноплянченко\n')
        file.write('Відповідь на питання першого студента:\n')
        file.write('Для створення списку можна використати два підходи:\n')
        file.write('1. Використання квадратних дужок: a = [1, 2, 3]\n')
        file.write('2. Використання методу list(obj), в якості obj приймається будь-який ітерабельний об\'єкт: a = list("test")\n')
        file.write('Питання від другого студента: Обрати 3 функції роботи з рядком і коротко їх описати\n')
    print("Файл дозаповнено рядками 2-го студента.")
except Exception as e:
    print(f"Виникла помилка ({type(e)}): {e}")
    
    # Вощенко Д. 3-ий студент
try:
    # відкриття файлу в режимі дозапису
    with open('questions1.txt', 'a', encoding='utf-8') as file:
        file.write('\n')
        file.write('Прізвище другого студента: Вощенко\n')
        file.write('Відповідь на питання другого студента:\n')
        file.write('len():\n')
        file.write('Опис: Ця функція повертає довжину рядка (тобто кількість символів у ньому).\n')
        file.write('split():\n')
        file.write('Опис: Розбиває рядок на список підрядків за вказаним роздільником (по замовчуванню пробіл).\n')
        file.write('join():\n')
        file.write('Опис: Об`єднує елементи списку в один рядок, використовуючи вказаний роздільник.\n')
        file.write('Питання від третього студента:Поясніть, як працює механізм обробки винятків у Python, який демонструє використання конструкцій try, except.\n')
    print("Файл дозаповнено рядками 3-го студента.")
except Exception as e:
    print(f"Виникла помилка ({type(e)}): {e}")
